       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQTEST3.

      **********************************************************
      * Program name:    SQTEST3
      * Original author: dastagg
      *
      * Maintenence Log
      * Date       Author        Maintenance Requirement
      * ---------  ------------  -------------------------------
      * 2020-07-29 dastagg       Dont know yet.
      *                          
      **********************************************************
